package example.first;

public class Ex6_1 {
    public static void main(String[] args) {
        /**
         * 객체지향 언어 탄생 배경
         * 80년대 초 소프트웨어의 위기 - 빠른 변화를 못 쫓아감
         * 해결책으로 객체지향 언어 도입(절차적 -> 객체지향)
         * 코드의 재사용성이 높고, 유지보수 용이, 중복 코드 제거
         * 객체지향 언어 = 프로그래밍 언어 + 객체지향개념(규칙)
         * 1. 캡슐화
         * 2. 상속
         * 3. 추상화
         * 4. 다형성
         *
         * 이해 하고 나서는 실습을 통해서 객체지향에 대한 이해를 몸으로 체득해야한다.
         * 객체지향언어는 직접 만들어보면서 설계를 해보는것이 좋음.
         * 실전을 통해서 알아가자.
         */
    }
}
