package example.first;

public class Ex6_2 {
    public static void main(String[] args) {
        /**
         * 클래스 : 객체를 정의해 놓은것, 객체를 생성하는데 사용함
         * 객체 : 실제로 존재하는 사물, 개념. 객체개 가지고 있는 기능과 속성에 따라 다름
         * 실제 세계에 있는 물체를 코드로 표현하기 위해 사용 됨
         *
         * 객체 = 속성(변수) + 기능(메서드)
         * 속성 -> 변수
         * ex) 크기, 길이 -> int size, int length
         * 기능 -> 메서드
         * ex) 켜기, 낮추기 -> void power(), void volumeDown()
         *
         * 객체 : 모든 인스턴스를 대표하는 용어
         * 인스턴스 : 특정 클래스로부터 생성된 객체 ex) Tv 인스턴스
         *
         * 설계도    인스턴스화     제품
         * 클래스 ------------> 인스턴스(객체)
         *
         * Q.클래스가 왜 필요한가?
         * A.객체를 생성하기 위해서
         *
         * Q.객체가 왜 필요한가?
         * A.객체를 사용하기 위해서
         *
         * Q.객체를 사용한다는 것은?
         * A.객체가 가진 속성과 기능을 사용하려고
         */
    }
}
